zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/M55M1.h
    BRAKE0_IRQn                   =  30,      /*!< EPWM0 Brake Interrupt                    */
    EPWM0P0_IRQn                  =  31,      /*!< EPWM0 Pair 0 Interrupt                   */
    EPWM0P1_IRQn                  =  32,      /*!< EPWM0 Pair 1 Interrupt                   */
    EPWM0P2_IRQn                  =  33,      /*!< EPWM0 Pair 2 Interrupt                   */
    BRAKE1_IRQn                   =  34,      /*!< EPWM1 Brake Interrupt                    */
    EPWM1P0_IRQn                  =  35,      /*!< EPWM1 Pair 0 Interrupt                   */
    EPWM1P1_IRQn                  =  36,      /*!< EPWM1 Pair 1 Interrupt                   */
    EPWM1P2_IRQn                  =  37,      /*!< EPWM1 Pair 2 Interrupt                   */
    BPWM0_IRQn                    =  38,      /*!< BPWM0 Interrupt                          */
    BPWM1_IRQn                    =  39,      /*!< BPWM1 Interrupt                          */

    /*!< Reserved                                 */
    PDMA0_IRQn                    =  41,      /*!< PDMA0 Interrupt                          */
    PDMA1_IRQn                    =  42,      /*!< PDMA1 Interrupt                          */
    LPPDMA_IRQn                   =  43,      /*!< Low Power PDMA Interrupt                 */
    SCU_IRQn                      =  44,      /*!< SCU Interrupt                            */
    /*!< Reserved                                 */
    KS_IRQn                       =  46,      /*!< Key Store Interrupt                      */
    TIMER0_IRQn                   =  47,      /*!< Timer0 Interrupt                         */
    TIMER1_IRQn                   =  48,      /*!< Timer1 Interrupt                         */
    TIMER2_IRQn                   =  49,      /*!< Timer2 Interrupt                         */

    TIMER3_IRQn                   =  50,      /*!< Timer3 Interrupt                         */
    LPTMR0_IRQn                   =  51,      /*!< Low Power Timer 0 Interrupt              */
    LPTMR1_IRQn                   =  52,      /*!< Low Power Timer 1 Interrupt              */
    /*!< Reserved                                 */
    TTMR0_IRQn                    =  54,      /*!< Tick Timer 0 Interrupt                   */
    TTMR1_IRQn                    =  55,      /*!< Tick Timer 1 Interrupt                   */
    USBH0_IRQn                    =  56,      /*!< USB Host 0 Interrupt                     */
    USBH1_IRQn                    =  57,      /*!< USB Host 1 Interrupt                     */
    USBD_IRQn                     =  58,      /*!< USB Device Interrupt                     */
    USBOTG_IRQn                   =  59,      /*!< USB OTG Interrupt                        */

    HSUSBH_IRQn                   =  60,      /*!< High Speed USB Host Interrupt            */
    HSUSBD_IRQn                   =  61,      /*!< High Speed USB Device Interrupt          */
    HSOTG_IRQn                    =  62,      /*!< High Speed OTG Interrupt                 */
    EMAC0_IRQn                    =  63,      /*!< EMAC0 Interrupt                          */
    QSPI0_IRQn                    =  64,      /*!< QSPI0 Interrupt                          */
    QSPI1_IRQn                    =  65,      /*!< QSPI1 Interrupt                          */
    SPI0_IRQn                     =  66,      /*!< SPI0 Interrupt                           */
    SPI1_IRQn                     =  67,      /*!< SPI1 Interrupt                           */
    SPI2_IRQn                     =  68,      /*!< SPI2 Interrupt                           */
    SPI3_IRQn                     =  69,      /*!< SPI3 Interrupt                           */

    /*!< Reserved                                 */
    LPSPI0_IRQn                   =  71,      /*!< Low Power SPI 0 Interrupt                */
    /*!< Reserved                                 */
    SPIM0_IRQn                    =  73,      /*!< SPIM0 Interrupt                          */
    /*!< Reserved                                 */
    UART0_IRQn                    =  75,      /*!< UART0 Interrupt                          */
    UART1_IRQn                    =  76,      /*!< UART1 Interrupt                          */
    UART2_IRQn                    =  77,      /*!< UART2 Interrupt                          */
    UART3_IRQn                    =  78,      /*!< UART3 Interrupt                          */
    UART4_IRQn                    =  79,      /*!< UART4 Interrupt                          */

    UART5_IRQn                    =  80,      /*!< UART5 Interrupt                          */
    UART6_IRQn                    =  81,      /*!< UART6 Interrupt                          */
    UART7_IRQn                    =  82,      /*!< UART7 Interrupt                          */
    UART8_IRQn                    =  83,      /*!< UART8 Interrupt                          */
    UART9_IRQn                    =  84,      /*!< UART9 Interrupt                          */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    EINT6_IRQn                    =  88,      /*!< External Input 6 Interrupt               */
    EINT7_IRQn                    =  89,      /*!< External Input 7 Interrupt               */

    LPUART0_IRQn                  =  90,      /*!< Low Power UART 0 Interrupt               */
    /*!< Reserved                                 */
    I2C0_IRQn                     =  92,      /*!< I2C0 Interrupt                           */
    I2C1_IRQn                     =  93,      /*!< I2C1 Interrupt                           */
    I2C2_IRQn                     =  94,      /*!< I2C2 Interrupt                           */
    I2C3_IRQn                     =  95,      /*!< I2C3 Interrupt                           */
    LPI2C0_IRQn                   =  96,      /*!< Low Power I2C 0 Interrupt                */
    USCI0_IRQn                    =  97,      /*!< USCI0 Interrupt                          */
    /*!< Reserved                                 */
    SC0_IRQn                      =  99,      /*!< Smart Card Host 0 Interrupt              */

    SC1_IRQn                      = 100,      /*!< Smart Card Host 1 Interrupt              */
    SC2_IRQn                      = 101,      /*!< Smart Card Host 2 Interrupt              */
    PSIO_IRQn                     = 102,      /*!< PSIO Interrupt                           */
    DMIC0_IRQn                    = 103,      /*!< DMIC0 Interrupt                          */
    DMIC0VAD_IRQn                 = 104,      /*!< DMIC0 VAD Interrupt                      */
    I2S0_IRQn                     = 105,      /*!< I2S0 Interrupt                           */
    I2S1_IRQn                     = 106,      /*!< I2S1 Interrupt                           */
    TRNG_IRQn                     = 107,      /*!< TRNG Interrupt                           */
    I3C0_IRQn                     = 108,      /*!< I3C0 Interrupt                           */
    /*!< Reserved                                 */

    OTFC0_IRQn                    = 110,      /*!< OTFC0 Interrupt                          */
    /*!< Reserved                                 */
    KPI_IRQn                      = 112,      /*!< KPI Interrupt                            */
    SDH0_IRQn                     = 113,      /*!< SD Host 0 Interrupt                      */
    SDH1_IRQn                     = 114,      /*!< SD Host 1 Interrupt                      */
    CCAP_IRQn                     = 115,      /*!< CCAP Interrupt                           */
    CRYPTO_IRQn                   = 116,      /*!< CRYPTO Interrupt                         */
    CANFD00_IRQn                  = 117,      /*!< CANFD00 Interrupt                        */
    CANFD01_IRQn                  = 118,      /*!< CANFD01 Interrupt                        */
    CANFD10_IRQn                  = 119,      /*!< CANFD10 Interrupt                        */

    CANFD11_IRQn                  = 120,      /*!< CANFD11 Interrupt                        */
    ACMP01_IRQn                   = 121,      /*!< ACMP0 and ACMP1 Interrupt                */
    ACMP23_IRQn                   = 122,      /*!< ACMP2 and ACMP3 Interrupt                */
    /*!< Reserved                                 */
    /*!< Reserved                                 */
    CRC_IRQn                      = 125,      /*!< CRC Interrupt                            */
    EADC00_IRQn                   = 126,      /*!< EADC0 Interrupt 0                        */
    EADC01_IRQn                   = 127,      /*!< EADC0 Interrupt 1                        */
    EADC02_IRQn                   = 128,      /*!< EADC0 Interrupt 2                        */
    EADC03_IRQn                   = 129,      /*!< EADC0 Interrupt 3                        */

