zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/M55M1.h
/** @addtogroup PERIPHERAL_MEMMAP Peripheral Memory Base
    Memory Mapped Structure for peripheral
    @{
 */

/* Peripheral and SRAM base address */
#define ITCM_BASE                 ((uint32_t)     0x00000000UL)  /*!< ITCM Base Address         */
#define FLASH_BASE                ((uint32_t)     0x00100000UL)  /*!< Flash Base Address        */
#define DTCM_BASE                 ((uint32_t)     0x20000000UL)  /*!< DTCM Base Address         */
#define SRAM_BASE                 ((uint32_t)     0x20100000UL)  /*!< SRAM0~2 Base Address      */
#define SRAM3_BASE                ((uint32_t)     0x20300000UL)  /*!< SRAM3 Base Address        */
#define LPSRAM_BASE               ((uint32_t)     0x20310000UL)  /*!< LPSRAM Base Address       */
#define PERIPH_BASE               ((uint32_t)     0x40000000UL)  /*!< Peripheral Base Address   */

/* Peripheral memory map */
#define AXIPERIPH_BASE            (PERIPH_BASE +  0x00000000UL)  /*!< AXI Base Address          */

#define AHB0PERIPH_BASE           (PERIPH_BASE +  0x00200000UL)  /*!< AHB0 Base Address         */
#define AHB1PERIPH_BASE           (PERIPH_BASE +  0x00040000UL)  /*!< AHB1 Base Address         */
#define AHB2PERIPH_BASE           (PERIPH_BASE +  0x00400000UL)  /*!< AHB2 Base Address         */

#define APB0PERIPH_BASE           (PERIPH_BASE +  0x00240000UL)  /*!< APB0 Base Address         */
#define APB1PERIPH_BASE           (PERIPH_BASE +  0x00250000UL)  /*!< APB1 Base Address         */
#define APB2PERIPH_BASE           (PERIPH_BASE +  0x00280000UL)  /*!< APB2 Base Address         */
#define APB3PERIPH_BASE           (PERIPH_BASE +  0x00290000UL)  /*!< APB3 Base Address         */
#define APB4PERIPH_BASE           (PERIPH_BASE +  0x00440000UL)  /*!< APB4 Base Address         */

/* AXI peripheral (PCLK5 clock domain) */
#define SYS_BASE                  (AXIPERIPH_BASE + 0x00000UL)
#define CLK_BASE                  (AXIPERIPH_BASE + 0x01000UL)
#define PMC_BASE                  (AXIPERIPH_BASE + 0x02000UL)
#define NPU_BASE                  (AXIPERIPH_BASE + 0x03000UL)
#define GDMA_BASE                 (AXIPERIPH_BASE + 0x04000UL)
#define SRAM0MPC_BASE             (AXIPERIPH_BASE + 0x08000UL)
#define SRAM1MPC_BASE             (AXIPERIPH_BASE + 0x09000UL)
#define SRAM2MPC_BASE             (AXIPERIPH_BASE + 0x0A000UL)
#define SRAM3MPC_BASE             (AXIPERIPH_BASE + 0x0B000UL)
#define SPIM0MPC_BASE             (AXIPERIPH_BASE + 0x0D000UL)
#define FMC_BASE                  (AXIPERIPH_BASE + 0x44000UL)  /*!< ACLK clock domain         */

/* AHB0 peripheral (HCLK0 clock domain) */
#define PDMA0_BASE                (AHB0PERIPH_BASE + 0x00000UL)
#define PDMA1_BASE                (AHB0PERIPH_BASE + 0x01000UL)
#define USBH0_BASE                (AHB0PERIPH_BASE + 0x02000UL)
#define USBH1_BASE                (AHB0PERIPH_BASE + 0x03000UL)
#define HSUSBH_BASE               (AHB0PERIPH_BASE + 0x04000UL)
#define HSUSBD_BASE               (AHB0PERIPH_BASE + 0x05000UL)
#define SDH0_BASE                 (AHB0PERIPH_BASE + 0x06000UL)
#define SDH1_BASE                 (AHB0PERIPH_BASE + 0x07000UL)
#define EMAC0_BASE                (AHB0PERIPH_BASE + 0x08000UL)
#define CRYPTO_BASE               (AHB0PERIPH_BASE + 0x0A000UL)
#define CRC_BASE                  (AHB0PERIPH_BASE + 0x0B000UL)

#define KS_BASE                   (AHB0PERIPH_BASE + 0x20000UL)
#define KDF_BASE                  (AHB0PERIPH_BASE + 0x21000UL)
#define CANFD0_BASE               (AHB0PERIPH_BASE + 0x22000UL)
#define CANFD1_BASE               (AHB0PERIPH_BASE + 0x24000UL)
#define GPIOA_BASE                (AHB0PERIPH_BASE + 0x29000UL)
#define GPIOB_BASE                (AHB0PERIPH_BASE + 0x29040UL)
#define GPIOC_BASE                (AHB0PERIPH_BASE + 0x29080UL)
#define GPIOD_BASE                (AHB0PERIPH_BASE + 0x290C0UL)
#define GPIOE_BASE                (AHB0PERIPH_BASE + 0x29100UL)
#define GPIOF_BASE                (AHB0PERIPH_BASE + 0x29140UL)
#define GPIOG_BASE                (AHB0PERIPH_BASE + 0x29180UL)
#define GPIOH_BASE                (AHB0PERIPH_BASE + 0x291C0UL)
#define GPIOI_BASE                (AHB0PERIPH_BASE + 0x29200UL)
#define GPIOJ_BASE                (AHB0PERIPH_BASE + 0x29240UL)
#define GPIO_INT_BASE             (AHB0PERIPH_BASE + 0x29440UL)
#define GPIO_PIN_DATA_BASE        (AHB0PERIPH_BASE + 0x29800UL)
#define EBI_BASE                  (AHB0PERIPH_BASE + 0x30000UL)

/* AHB1 peripheral (HCLK1 clock domain) */
#define OTFC0_BASE                (AHB1PERIPH_BASE + 0x00000UL)
#define SPIM0_BASE                (AHB1PERIPH_BASE + 0x02000UL)
/* AHB2 peripheral (HCLK2 clock domain) */
#define LPPDMA_BASE               (AHB2PERIPH_BASE + 0x00000UL)
#define CCAP_BASE                 (AHB2PERIPH_BASE + 0x01000UL)
#define SCU_BASE                  (AHB2PERIPH_BASE + 0x02000UL)
#define FVC_BASE                  (AHB2PERIPH_BASE + 0x02500UL)
#define DPM_BASE                  (AHB2PERIPH_BASE + 0x02600UL)
#define PLM_BASE                  (AHB2PERIPH_BASE + 0x02700UL)
#define LPGPIO_BASE               (AHB2PERIPH_BASE + 0x03000UL)

/* APB0 peripheral (PCLK0 clock domain) */
#define WWDT0_BASE                (APB0PERIPH_BASE + 0x00000UL)
#define EADC0_BASE                (APB0PERIPH_BASE + 0x01000UL)
#define EPWM0_BASE                (APB0PERIPH_BASE + 0x02000UL)
#define BPWM0_BASE                (APB0PERIPH_BASE + 0x03000UL)
#define EQEI0_BASE                (APB0PERIPH_BASE + 0x04000UL)
#define EQEI2_BASE                (APB0PERIPH_BASE + 0x05000UL)
#define ECAP0_BASE                (APB0PERIPH_BASE + 0x06000UL)
#define ECAP2_BASE                (APB0PERIPH_BASE + 0x07000UL)
#define I2C0_BASE                 (APB0PERIPH_BASE + 0x08000UL)
#define I2C2_BASE                 (APB0PERIPH_BASE + 0x09000UL)
#define QSPI0_BASE                (APB0PERIPH_BASE + 0x0A000UL)
#define SPI0_BASE                 (APB0PERIPH_BASE + 0x0B000UL)
#define SPI2_BASE                 (APB0PERIPH_BASE + 0x0C000UL)
#define UART0_BASE                (APB0PERIPH_BASE + 0x0D000UL)
#define UART2_BASE                (APB0PERIPH_BASE + 0x0E000UL)
#define UART4_BASE                (APB0PERIPH_BASE + 0x0F000UL)

/* APB1 peripheral (PCLK1 clock domain) */
#define UART6_BASE                (APB1PERIPH_BASE + 0x00000UL)
#define UART8_BASE                (APB1PERIPH_BASE + 0x01000UL)
#define USCI0_BASE                (APB1PERIPH_BASE + 0x02000UL)
#define SC0_BASE                  (APB1PERIPH_BASE + 0x03000UL)
#define SC2_BASE                  (APB1PERIPH_BASE + 0x04000UL)
#define PSIO_BASE                 (APB1PERIPH_BASE + 0x05000UL)
#define TIMER0_BASE               (APB1PERIPH_BASE + 0x06000UL)
#define TIMER1_BASE               (APB1PERIPH_BASE + 0x06100UL)
#define DAC0_BASE                 (APB1PERIPH_BASE + 0x07000UL)
#define DAC1_BASE                 (APB1PERIPH_BASE + 0x07040UL)
#define HSOTG_BASE                (APB1PERIPH_BASE + 0x09000UL)
#define I2S0_BASE                 (APB1PERIPH_BASE + 0x0A000UL)
#define ACMP01_BASE               (APB1PERIPH_BASE + 0x0B000UL)
#define USBD_BASE                 (APB1PERIPH_BASE + 0x0C000UL)

/* APB2 peripheral (PCLK2 clock domain) */
#define WWDT1_BASE                (APB2PERIPH_BASE + 0x00000UL)
#define EPWM1_BASE                (APB2PERIPH_BASE + 0x02000UL)
#define BPWM1_BASE                (APB2PERIPH_BASE + 0x03000UL)
#define EQEI1_BASE                (APB2PERIPH_BASE + 0x04000UL)
#define EQEI3_BASE                (APB2PERIPH_BASE + 0x05000UL)
#define ECAP1_BASE                (APB2PERIPH_BASE + 0x06000UL)
#define ECAP3_BASE                (APB2PERIPH_BASE + 0x07000UL)
#define I2C1_BASE                 (APB2PERIPH_BASE + 0x08000UL)
#define I2C3_BASE                 (APB2PERIPH_BASE + 0x09000UL)
#define QSPI1_BASE                (APB2PERIPH_BASE + 0x0A000UL)
#define SPI1_BASE                 (APB2PERIPH_BASE + 0x0B000UL)
#define SPI3_BASE                 (APB2PERIPH_BASE + 0x0C000UL)
#define UART1_BASE                (APB2PERIPH_BASE + 0x0D000UL)
#define UART3_BASE                (APB2PERIPH_BASE + 0x0E000UL)
#define UART5_BASE                (APB2PERIPH_BASE + 0x0F000UL)

/* APB3 peripheral (PCLK3 clock domain) */
#define UART7_BASE                (APB3PERIPH_BASE + 0x00000UL)
#define UART9_BASE                (APB3PERIPH_BASE + 0x01000UL)
#define SC1_BASE                  (APB3PERIPH_BASE + 0x02000UL)
#define OTG_BASE                  (APB3PERIPH_BASE + 0x03000UL)
#define KPI_BASE                  (APB3PERIPH_BASE + 0x04000UL)
#define TIMER2_BASE               (APB3PERIPH_BASE + 0x05000UL)
#define TIMER3_BASE               (APB3PERIPH_BASE + 0x05100UL)
#define TRNG_BASE                 (APB3PERIPH_BASE + 0x06000UL)
#define RTC_BASE                  (APB3PERIPH_BASE + 0x07000UL)
#define I2S1_BASE                 (APB3PERIPH_BASE + 0x08000UL)
#define ACMP23_BASE               (APB3PERIPH_BASE + 0x09000UL)
#define I3C0_BASE                 (APB3PERIPH_BASE + 0x0A000UL)
#define UTCPD_BASE                (APB3PERIPH_BASE + 0x0B000UL)

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UTCPD_Msk)
#define UTCPD0_BASE               (APB3PERIPH_BASE + 0x0B000UL+ NS_OFFSET)
#define UTCPD1_BASE               (APB3PERIPH_BASE + 0x0B000UL+ NS_OFFSET)
#else
#define UTCPD0_BASE               (APB3PERIPH_BASE + 0x0B000UL)
#define UTCPD1_BASE               (APB3PERIPH_BASE + 0x0B000UL)
#endif

