zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/M55M1.h
/* APB4 peripheral (PCLK4 clock domain) */
#define LPTMR0_BASE               (APB4PERIPH_BASE + 0x00000UL)
#define LPTMR1_BASE               (APB4PERIPH_BASE + 0x00100UL)
#define TTMR0_BASE                (APB4PERIPH_BASE + 0x01000UL)
#define TTMR1_BASE                (APB4PERIPH_BASE + 0x01100UL)
#define LPADC0_BASE               (APB4PERIPH_BASE + 0x02000UL)
#define LPI2C0_BASE               (APB4PERIPH_BASE + 0x03000UL)
#define LPSPI0_BASE               (APB4PERIPH_BASE + 0x04000UL)
#define DMIC0_BASE                (APB4PERIPH_BASE + 0x05000UL)
#define VAD0_BASE                 (APB4PERIPH_BASE + 0x05300UL)
#define LPUART0_BASE              (APB4PERIPH_BASE + 0x06000UL)
#define WDT0_BASE                 (APB4PERIPH_BASE + 0x07000UL)
#define WDT1_BASE                 (APB4PERIPH_BASE + 0x08000UL)
#define AWF_BASE                  (APB4PERIPH_BASE + 0x09000UL)
#define LPSRAMMPC_BASE            (APB4PERIPH_BASE + 0x10000UL)

/** @} end of group PERIPHERAL_MEMMAP */


/******************************************************************************/
/*                         Peripheral Declaration                             */
/******************************************************************************/

/** @addtogroup PERIPHERAL_DECLARATION Peripheral Pointer
  The Declaration of Peripheral Pointer
  @{
 */

/** @addtogroup PERIPHERAL_S Secure Peripheral Pointer
    The Declaration of Secure Peripheral Pointer
    @{
*/

#define ACMP01_S                  ((ACMP_T *)     ACMP01_BASE)
#define ACMP23_S                  ((ACMP_T *)     ACMP23_BASE)
#define AWF_S                     ((AWF_T *)      AWF_BASE)
#define BPWM0_S                   ((BPWM_T *)     BPWM0_BASE)
#define BPWM1_S                   ((BPWM_T *)     BPWM1_BASE)
#define CANFD0_S                  ((CANFD_T *)    CANFD0_BASE)
#define CANFD1_S                  ((CANFD_T *)    CANFD1_BASE)
#define CCAP_S                    ((CCAP_T *)     CCAP_BASE)
#define CLK_S                     ((CLK_T *)      CLK_BASE)
#define CRC_S                     ((CRC_T *)      CRC_BASE)
#define CRYPTO_S                  ((CRYPTO_T *)   CRYPTO_BASE)
#define DAC0_S                    ((DAC_T *)      DAC0_BASE)
#define DAC1_S                    ((DAC_T *)      DAC1_BASE)
#define DMIC0_S                   ((DMIC_T *)     DMIC0_BASE)
#define DPM_S                     ((DPM_T *)      DPM_BASE)
#define EADC0_S                   ((EADC_T *)     EADC0_BASE)
#define ECAP0_S                   ((ECAP_T *)     ECAP0_BASE)
#define ECAP1_S                   ((ECAP_T *)     ECAP1_BASE)
#define ECAP2_S                   ((ECAP_T *)     ECAP2_BASE)
#define ECAP3_S                   ((ECAP_T *)     ECAP3_BASE)
#define EBI_S                     ((EBI_T *)      EBI_BASE)
#define EPWM0_S                   ((EPWM_T *)     EPWM0_BASE)
#define EPWM1_S                   ((EPWM_T *)     EPWM1_BASE)
#define EQEI0_S                   ((EQEI_T *)     EQEI0_BASE)
#define EQEI1_S                   ((EQEI_T *)     EQEI1_BASE)
#define EQEI2_S                   ((EQEI_T *)     EQEI2_BASE)
#define EQEI3_S                   ((EQEI_T *)     EQEI3_BASE)
#define FMC_S                     ((FMC_T *)      FMC_BASE)
#define FVC_S                     ((FVC_T *)      FVC_BASE)

#define GDMA_S                                   (GDMA_BASE)
#define GPIO_S                    ((GPIO_INT_T *) GPIO_INT_BASE)
#define HSOTG_S                   ((HSOTG_T *)    HSOTG_BASE)
#define HSUSBD_S                  ((HSUSBD_T *)   HSUSBD_BASE)
#define HSUSBH_S                  ((HSUSBH_T *)   HSUSBH_BASE)
#define I2C0_S                    ((I2C_T *)      I2C0_BASE)
#define I2C1_S                    ((I2C_T *)      I2C1_BASE)
#define I2C2_S                    ((I2C_T *)      I2C2_BASE)
#define I2C3_S                    ((I2C_T *)      I2C3_BASE)
#define I2S0_S                    ((I2S_T *)      I2S0_BASE)
#define I2S1_S                    ((I2S_T *)      I2S1_BASE)
#define I3C0_S                    ((I3C_T *)      I3C0_BASE)
#define KDF_S                     ((KDF_T *)      KDF_BASE)
#define KPI_S                     ((KPI_T *)      KPI_BASE)
#define KS_S                      ((KS_T *)       KS_BASE)
#define LPADC0_S                  ((LPADC_T *)    LPADC0_BASE)
#define LPGPIO_S                  ((LPGPIO_T *)   LPGPIO_BASE)
#define LPI2C0_S                  ((LPI2C_T *)    LPI2C0_BASE)
#define LPPDMA_S                  ((LPPDMA_T *)   LPPDMA_BASE)
#define LPSPI0_S                  ((LPSPI_T *)    LPSPI0_BASE)
#define LPTMR0_S                  ((LPTMR_T *)    LPTMR0_BASE)
#define LPTMR1_S                  ((LPTMR_T *)    LPTMR1_BASE)
#define LPUART0_S                 ((LPUART_T *)   LPUART0_BASE)

#define NPU_S                                    (NPU_BASE)
#define OTFC0_S                   ((OTFC_T *)     OTFC0_BASE)
#define OTG_S                     ((OTG_T *)      OTG_BASE)
#define PA_S                      ((GPIO_T *)     GPIOA_BASE)
#define PB_S                      ((GPIO_T *)     GPIOB_BASE)
#define PC_S                      ((GPIO_T *)     GPIOC_BASE)
#define PD_S                      ((GPIO_T *)     GPIOD_BASE)
#define PE_S                      ((GPIO_T *)     GPIOE_BASE)
#define PF_S                      ((GPIO_T *)     GPIOF_BASE)
#define PG_S                      ((GPIO_T *)     GPIOG_BASE)
#define PH_S                      ((GPIO_T *)     GPIOH_BASE)
#define PI_S                      ((GPIO_T *)     GPIOI_BASE)
#define PJ_S                      ((GPIO_T *)     GPIOJ_BASE)
#define PDMA0_S                   ((PDMA_T *)     PDMA0_BASE)
#define PDMA1_S                   ((PDMA_T *)     PDMA1_BASE)
#define PLM_S                     ((PLM_T *)      PLM_BASE)
#define PMC_S                     ((PMC_T *)      PMC_BASE)
#define PSIO_S                    ((PSIO_T *)     PSIO_BASE)
#define QSPI0_S                   ((QSPI_T *)     QSPI0_BASE)
#define QSPI1_S                   ((QSPI_T *)     QSPI1_BASE)
#define RTC_S                     ((RTC_T *)      RTC_BASE)

#define SC0_S                     ((SC_T *)       SC0_BASE)
#define SC1_S                     ((SC_T *)       SC1_BASE)
#define SC2_S                     ((SC_T *)       SC2_BASE)
#define SCU_S                     ((SCU_T *)      SCU_BASE)
#define SDH0_S                    ((SDH_T *)      SDH0_BASE)
#define SDH1_S                    ((SDH_T *)      SDH1_BASE)
#define SPI0_S                    ((SPI_T *)      SPI0_BASE)
#define SPI1_S                    ((SPI_T *)      SPI1_BASE)
#define SPI2_S                    ((SPI_T *)      SPI2_BASE)
#define SPI3_S                    ((SPI_T *)      SPI3_BASE)
#define SPIM0_S                   ((SPIM_T *)     SPIM0_BASE)
#define SYS_S                     ((SYS_T *)      SYS_BASE)
#define TIMER0_S                  ((TIMER_T *)    TIMER0_BASE)
#define TIMER1_S                  ((TIMER_T *)    TIMER1_BASE)
#define TIMER2_S                  ((TIMER_T *)    TIMER2_BASE)
#define TIMER3_S                  ((TIMER_T *)    TIMER3_BASE)
#define TRNG_S                    ((TRNG_T *)     TRNG_BASE)
#define TTMR0_S                   ((TTMR_T *)     TTMR0_BASE)
#define TTMR1_S                   ((TTMR_T *)     TTMR1_BASE)
#define UART0_S                   ((UART_T *)     UART0_BASE)
#define UART1_S                   ((UART_T *)     UART1_BASE)
#define UART2_S                   ((UART_T *)     UART2_BASE)
#define UART3_S                   ((UART_T *)     UART3_BASE)
#define UART4_S                   ((UART_T *)     UART4_BASE)
#define UART5_S                   ((UART_T *)     UART5_BASE)
#define UART6_S                   ((UART_T *)     UART6_BASE)
#define UART7_S                   ((UART_T *)     UART7_BASE)
#define UART8_S                   ((UART_T *)     UART8_BASE)
#define UART9_S                   ((UART_T *)     UART9_BASE)
#define USBH0_S                   ((USBH_T *)     USBH0_BASE)
#define USBH1_S                   ((USBH1_T *)    USBH1_BASE)
#define USBD_S                    ((USBD_T *)     USBD_BASE)
#define UI2C0_S                   ((UI2C_T *)     USCI0_BASE)
#define USPI0_S                   ((USPI_T *)     USCI0_BASE)
#define UTCPD_S                   ((UTCPD_T *)    UTCPD_BASE)
#define UUART0_S                  ((UUART_T *)    USCI0_BASE)
#define VAD0_S                    ((VAD_T *)      VAD0_BASE)
#define WDT0_S                    ((WDT_T *)      WDT0_BASE)
#define WWDT0_S                   ((WWDT_T *)     WWDT0_BASE)
#define WWDT1_S                   ((WWDT_T *)     WWDT1_BASE)

/** @} end of group PERIPHERAL_S */

/** @addtogroup PERIPHERAL_NS Non-Secure Peripheral Pointer
    The Declaration of Non-Secure Peripheral Pointer
    @{
*/

#define NS_OFFSET                 ((uint32_t)     0x10000000UL)   /*!< Non-Secure Address Offset */

#define ACMP01_NS                 ((ACMP_T *)     (ACMP01_BASE    + NS_OFFSET))
#define ACMP23_NS                 ((ACMP_T *)     (ACMP23_BASE    + NS_OFFSET))
#define AWF_NS                    ((AWF_T *)      (AWF_BASE       + NS_OFFSET))
#define BPWM0_NS                  ((BPWM_T *)     (BPWM0_BASE     + NS_OFFSET))
#define BPWM1_NS                  ((BPWM_T *)     (BPWM1_BASE     + NS_OFFSET))
#define CANFD0_NS                 ((CANFD_T *)    (CANFD0_BASE    + NS_OFFSET))
#define CANFD1_NS                 ((CANFD_T *)    (CANFD1_BASE    + NS_OFFSET))
#define CCAP_NS                   ((CCAP_T *)     (CCAP_BASE      + NS_OFFSET))
#define CRC_NS                    ((CRC_T *)      (CRC_BASE       + NS_OFFSET))
#define CRYPTO_NS                 ((CRYPTO_T *)   (CRYPTO_BASE    + NS_OFFSET))
#define DAC0_NS                   ((DAC_T *)      (DAC0_BASE      + NS_OFFSET))
#define DAC1_NS                   ((DAC_T *)      (DAC1_BASE      + NS_OFFSET))
#define DMIC0_NS                  ((DMIC_T *)     (DMIC0_BASE     + NS_OFFSET))
#define EADC0_NS                  ((EADC_T *)     (EADC0_BASE     + NS_OFFSET))
#define ECAP0_NS                  ((ECAP_T *)     (ECAP0_BASE     + NS_OFFSET))
#define ECAP1_NS                  ((ECAP_T *)     (ECAP1_BASE     + NS_OFFSET))
#define ECAP2_NS                  ((ECAP_T *)     (ECAP2_BASE     + NS_OFFSET))
#define ECAP3_NS                  ((ECAP_T *)     (ECAP3_BASE     + NS_OFFSET))
#define EBI_NS                    ((EBI_T *)      (EBI_BASE       + NS_OFFSET))
#define EPWM0_NS                  ((EPWM_T *)     (EPWM0_BASE     + NS_OFFSET))
#define EPWM1_NS                  ((EPWM_T *)     (EPWM1_BASE     + NS_OFFSET))
#define EQEI0_NS                  ((EQEI_T *)     (EQEI0_BASE     + NS_OFFSET))
#define EQEI1_NS                  ((EQEI_T *)     (EQEI1_BASE     + NS_OFFSET))
#define EQEI2_NS                  ((EQEI_T *)     (EQEI2_BASE     + NS_OFFSET))
#define EQEI3_NS                  ((EQEI_T *)     (EQEI3_BASE     + NS_OFFSET))
#define FMC_NS                    ((FMC_T *)      (FMC_BASE       + NS_OFFSET))

#define GDMA_NS                                   (GDMA_BASE      + NS_OFFSET)
#define GPIO_NS                   ((GPIO_INT_T *) (GPIO_INT_BASE  + NS_OFFSET))
#define HSOTG_NS                  ((HSOTG_T *)    (HSOTG_BASE     + NS_OFFSET))
#define HSUSBD_NS                 ((HSUSBD_T *)   (HSUSBD_BASE    + NS_OFFSET))
#define HSUSBH_NS                 ((HSUSBH_T *)   (HSUSBH_BASE    + NS_OFFSET))
#define I2C0_NS                   ((I2C_T *)      (I2C0_BASE      + NS_OFFSET))
#define I2C1_NS                   ((I2C_T *)      (I2C1_BASE      + NS_OFFSET))
#define I2C2_NS                   ((I2C_T *)      (I2C2_BASE      + NS_OFFSET))
#define I2C3_NS                   ((I2C_T *)      (I2C3_BASE      + NS_OFFSET))
#define I2S0_NS                   ((I2S_T *)      (I2S0_BASE      + NS_OFFSET))
#define I2S1_NS                   ((I2S_T *)      (I2S1_BASE      + NS_OFFSET))
#define I3C0_NS                   ((I3C_T *)      (I3C0_BASE      + NS_OFFSET))
#define KDF_NS                    ((KDF_T *)      (KDF_BASE       + NS_OFFSET))
#define KPI_NS                    ((KPI_T *)      (KPI_BASE       + NS_OFFSET))
#define LPADC0_NS                 ((LPADC_T *)    (LPADC0_BASE    + NS_OFFSET))
#define LPGPIO_NS                 ((LPGPIO_T *)   (LPGPIO_BASE    + NS_OFFSET))
#define LPI2C0_NS                 ((LPI2C_T *)    (LPI2C0_BASE    + NS_OFFSET))
#define LPPDMA_NS                 ((LPPDMA_T *)   (LPPDMA_BASE    + NS_OFFSET))
#define LPSPI0_NS                 ((LPSPI_T *)    (LPSPI0_BASE    + NS_OFFSET))
#define LPTMR0_NS                 ((LPTMR_T *)    (LPTMR0_BASE    + NS_OFFSET))
#define LPTMR1_NS                 ((LPTMR_T *)    (LPTMR1_BASE    + NS_OFFSET))
#define LPUART0_NS                ((LPUART_T *)   (LPUART0_BASE   + NS_OFFSET))

