zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/M55M1.h
#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_USBH1_Msk)
#define USBH1        USBH1_NS
#else
#define USBH1        USBH1_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_HSUSBH_Msk)
#define HSUSBH       HSUSBH_NS
#else
#define HSUSBH       HSUSBH_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_HSUSBD_Msk)
#define HSUSBD       HSUSBD_NS
#else
#define HSUSBD       HSUSBD_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_SDH0_Msk)
#define SDH0         SDH0_NS
#else
#define SDH0         SDH0_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_SDH1_Msk)
#define SDH1         SDH1_NS
#else
#define SDH1         SDH1_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_CRYPTO_Msk)
#define CRYPTO       CRYPTO_NS
#else
#define CRYPTO       CRYPTO_S
#endif

#if defined (SCU_INIT_D1PNS0_VAL) && (SCU_INIT_D1PNS0_VAL & SCU_D1PNS0_CRC_Msk)
#define CRC          CRC_NS
#else
#define CRC          CRC_S
#endif

/* SCU_D1PNS1 */
#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_KDF_Msk)
#define KDF          KDF_NS
#else
#define KDF          KDF_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_CANFD0_Msk)
#define CANFD0       CANFD0_NS
#else
#define CANFD0       CANFD0_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_CANFD1_Msk)
#define CANFD1       CANFD1_NS
#else
#define CANFD1       CANFD1_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_ETMC_Msk)
#define ETMC         ETMC_NS
#else
#define ETMC         ETMC_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_SWDH_Msk)
#define SWDH         SWDH_NS
#else
#define SWDH         SWDH_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_SWODEC_Msk)
#define SWODEC       SWODEC_NS
#else
#define SWODEC       SWODEC_S
#endif

#if defined (SCU_INIT_D1PNS1_VAL) && (SCU_INIT_D1PNS1_VAL & SCU_D1PNS1_EBI_Msk)
#define EBI          EBI_NS
#else
#define EBI          EBI_S
#endif

/* SCU_D1PNS2 */
#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_WWDT0_Msk)
#define WWDT0        WWDT0_NS
#else
#define WWDT0        WWDT0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EADC0_Msk)
#define EADC0        EADC0_NS
#else
#define EADC0        EADC0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EPWM0_Msk)
#define EPWM0        EPWM0_NS
#else
#define EPWM0        EPWM0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_BPWM0_Msk)
#define BPWM0        BPWM0_NS
#else
#define BPWM0        BPWM0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EQEI0_Msk)
#define EQEI0        EQEI0_NS
#else
#define EQEI0        EQEI0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_EQEI2_Msk)
#define EQEI2        EQEI2_NS
#else
#define EQEI2        EQEI2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ECAP0_Msk)
#define ECAP0        ECAP0_NS
#else
#define ECAP0        ECAP0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ECAP2_Msk)
#define ECAP2        ECAP2_NS
#else
#define ECAP2        ECAP2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2C0_Msk)
#define I2C0         I2C0_NS
#else
#define I2C0         I2C0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2C2_Msk)
#define I2C2         I2C2_NS
#else
#define I2C2         I2C2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_QSPI0_Msk)
#define QSPI0        QSPI0_NS
#else
#define QSPI0        QSPI0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SPI0_Msk)
#define SPI0         SPI0_NS
#else
#define SPI0         SPI0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SPI2_Msk)
#define SPI2         SPI2_NS
#else
#define SPI2         SPI2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART0_Msk)
#define UART0        UART0_NS
#else
#define UART0        UART0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART2_Msk)
#define UART2        UART2_NS
#else
#define UART2        UART2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART4_Msk)
#define UART4        UART4_NS
#else
#define UART4        UART4_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART6_Msk)
#define UART6        UART6_NS
#else
#define UART6        UART6_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_UART8_Msk)
#define UART8        UART8_NS
#else
#define UART8        UART8_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_USCI0_Msk)
#define USCI0        USCI0_NS
#define UI2C0        UI2C0_NS
#define USPI0        USPI0_NS
#define UUART0       UUART0_NS
#else
#define USCI0        USCI0_S
#define UI2C0        UI2C0_S
#define USPI0        USPI0_S
#define UUART0       UUART0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SC0_Msk)
#define SC0          SC0_NS
#else
#define SC0          SC0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_SC2_Msk)
#define SC2          SC2_NS
#else
#define SC2          SC2_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_PSIO_Msk)
#define PSIO         PSIO_NS
#else
#define PSIO         PSIO_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_TMR01_Msk)
#define TIMER0       TIMER0_NS
#define TIMER1       TIMER1_NS
#else
#define TIMER0       TIMER0_S
#define TIMER1       TIMER1_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_DAC01_Msk)
#define DAC0         DAC0_NS
#define DAC1         DAC1_NS
#else
#define DAC0         DAC0_S
#define DAC1         DAC1_S
#endif

