zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/M55M1.h
#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_HSOTG_Msk)
#define HSOTG        HSOTG_NS
#else
#define HSOTG        HSOTG_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_I2S0_Msk)
#define I2S0         I2S0_NS
#else
#define I2S0         I2S0_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_ACMP01_Msk)
#define ACMP01       ACMP01_NS
#else
#define ACMP01       ACMP01_S
#endif

#if defined (SCU_INIT_D1PNS2_VAL) && (SCU_INIT_D1PNS2_VAL & SCU_D1PNS2_USBD_Msk)
#define USBD         USBD_NS
#else
#define USBD         USBD_S
#endif

/* SCU_D1PNS4 */
#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_WWDT1_Msk)
#define WWDT1        WWDT1_NS
#else
#define WWDT1        WWDT1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EPWM1_Msk)
#define EPWM1        EPWM1_NS
#else
#define EPWM1        EPWM1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_BPWM1_Msk)
#define BPWM1        BPWM1_NS
#else
#define BPWM1        BPWM1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EQEI1_Msk)
#define EQEI1        EQEI1_NS
#else
#define EQEI1        EQEI1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_EQEI3_Msk)
#define EQEI3        EQEI3_NS
#else
#define EQEI3        EQEI3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ECAP1_Msk)
#define ECAP1        ECAP1_NS
#else
#define ECAP1        ECAP1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ECAP3_Msk)
#define ECAP3        ECAP3_NS
#else
#define ECAP3        ECAP3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2C1_Msk)
#define I2C1         I2C1_NS
#else
#define I2C1         I2C1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2C3_Msk)
#define I2C3         I2C3_NS
#else
#define I2C3         I2C3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_QSPI1_Msk)
#define QSPI1        QSPI1_NS
#else
#define QSPI1        QSPI1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SPI1_Msk)
#define SPI1         SPI1_NS
#else
#define SPI1         SPI1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SPI3_Msk)
#define SPI3         SPI3_NS
#else
#define SPI3         SPI3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART1_Msk)
#define UART1        UART1_NS
#else
#define UART1        UART1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART3_Msk)
#define UART3        UART3_NS
#else
#define UART3        UART3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART5_Msk)
#define UART5        UART5_NS
#else
#define UART5        UART5_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART7_Msk)
#define UART7        UART7_NS
#else
#define UART7        UART7_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UART9_Msk)
#define UART9        UART9_NS
#else
#define UART9        UART9_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_SC1_Msk)
#define SC1          SC1_NS
#else
#define SC1          SC1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_OTG_Msk)
#define OTG          OTG_NS
#else
#define OTG          OTG_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_KPI_Msk)
#define KPI          KPI_NS
#else
#define KPI          KPI_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_TMR23_Msk)
#define TIMER2       TIMER2_NS
#define TIMER3       TIMER3_NS
#else
#define TIMER2       TIMER2_S
#define TIMER3       TIMER3_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_TRNG_Msk)
#define TRNG         TRNG_NS
#else
#define TRNG         TRNG_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_RTC_Msk)
#define RTC          RTC_NS
#else
#define RTC          RTC_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I2S1_Msk)
#define I2S1         I2S1_NS
#else
#define I2S1         I2S1_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_ACMP23_Msk)
#define ACMP23       ACMP23_NS
#else
#define ACMP23       ACMP23_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_I3C0_Msk)
#define I3C0         I3C0_NS
#else
#define I3C0         I3C0_S
#endif

#if defined (SCU_INIT_D1PNS4_VAL) && (SCU_INIT_D1PNS4_VAL & SCU_D1PNS4_UTCPD_Msk)
#define UTCPD        UTCPD_NS
#else
#define UTCPD        UTCPD_S
#endif

/* SCU_D2PNS0 */
#if defined (SCU_INIT_D2PNS0_VAL) && (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_LPPDMA_Msk)
#define LPPDMA       LPPDMA_NS
#else
#define LPPDMA       LPPDMA_S
#endif

#if defined (SCU_INIT_D2PNS0_VAL) && (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_CCAP_Msk)
#define CCAP         CCAP_NS
#else
#define CCAP         CCAP_S
#endif

#if defined (SCU_INIT_D2PNS0_VAL) && (SCU_INIT_D2PNS0_VAL & SCU_D2PNS0_LPGPIO_Msk)
#define LPGPIO       LPGPIO_NS
#else
#define LPGPIO       LPGPIO_S
#endif

/* SCU_D2PNS2 */
#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPTMR01_Msk)
#define LPTMR0       LPTMR0_NS
#define LPTMR1       LPTMR1_NS
#else
#define LPTMR0       LPTMR0_S
#define LPTMR1       LPTMR1_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_TTMR01_Msk)
#define TTMR0        TTMR0_NS
#define TTMR1        TTMR1_NS
#else
#define TTMR0        TTMR0_S
#define TTMR1        TTMR1_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPADC0_Msk)
#define LPADC0       LPADC0_NS
#else
#define LPADC0       LPADC0_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPI2C0_Msk)
#define LPI2C0       LPI2C0_NS
#else
#define LPI2C0       LPI2C0_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPSPI0_Msk)
#define LPSPI0       LPSPI0_NS
#else
#define LPSPI0       LPSPI0_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_DMIC0_Msk)
#define DMIC0        DMIC0_NS
#define VAD0         VAD0_NS
#else
#define DMIC0        DMIC0_S
#define VAD0         VAD0_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_LPUART0_Msk)
#define LPUART0      LPUART0_NS
#else
#define LPUART0      LPUART0_S
#endif

#if defined (SCU_INIT_D2PNS2_VAL) && (SCU_INIT_D2PNS2_VAL & SCU_D2PNS2_AWF_Msk)
#define AWF          AWF_NS
#else
#define AWF          AWF_S
#endif

/** @} end of group PERIPHERAL_SNS */
/** @} end of group PERIPHERAL_DECLARATION */


/* --------------------  End of section using anonymous unions  ------------------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif (__AFMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif


/*=============================================================================*/

